; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p10)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 a3 - Aircraft
 c1 c2 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c1)
(fuel-level a2 f2) (at a2 c2)
(fuel-level a3 f2) (at a3 c1)
(at p1 c2)
(at p2 c1)
(at p3 c2)
(at p4 c1)
(at p5 c2)
(at p6 c2)
(at p7 c1)
(at p8 c2)
(at p9 c2)
(at p10 c2)
(at p11 c1)
(at p12 c2)
(at p13 c1)
(at p14 c1)
(at p15 c1)
(at p16 c1)
(at p17 c2)
(at p18 c2)
(at p19 c2)
(at p20 c2)
)
(:goal (and
(at a1 c1)
(at a2 c2)
(at a3 c1)
(at p1 c2)
(at p2 c1)
(at p3 c1)
(at p4 c1)
(at p5 c1)
(at p6 c2)
(at p7 c1)
(at p8 c2)
(at p9 c1)
(at p10 c2)
(at p11 c2)
(at p12 c2)
(at p13 c2)
(at p14 c1)
(at p15 c2)
(at p16 c2)
(at p17 c1)
(at p18 c1)
(at p19 c1)
(at p20 c2)
))
)

; plan
1. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 12 of 23
2. (board p3 a1 c2)
   deleted: (at p3 c2)
   added: (in p3 a1)
   goals met: 12 of 23
3. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 13 of 23
4. (debark p3 a1 c1)
   deleted: (in p3 a1)
   added: (at p3 c1)
   goals met: 14 of 23
5. (board p5 a2 c2)
   deleted: (at p5 c2)
   added: (in p5 a2)
   goals met: 14 of 23
6. (fly a2 c2 c1 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 13 of 23
7. (debark p5 a2 c1)
   deleted: (in p5 a2)
   added: (at p5 c1)
   goals met: 14 of 23
8. (fly a3 c1 c2 f2 f1)
   deleted: (at a3 c1) (fuel-level a3 f2)
   added: (at a3 c2) (fuel-level a3 f1)
   goals met: 13 of 23
9. (board p9 a3 c2)
   deleted: (at p9 c2)
   added: (in p9 a3)
   goals met: 13 of 23
10. (fly a3 c2 c1 f1 f0)
   deleted: (at a3 c2) (fuel-level a3 f1)
   added: (at a3 c1) (fuel-level a3 f0)
   goals met: 14 of 23
11. (debark p9 a3 c1)
   deleted: (in p9 a3)
   added: (at p9 c1)
   goals met: 15 of 23
12. (board p11 a1 c1)
   deleted: (at p11 c1)
   added: (in p11 a1)
   goals met: 15 of 23
13. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 15 of 23
14. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 14 of 23
15. (debark p11 a1 c2)
   deleted: (in p11 a1)
   added: (at p11 c2)
   goals met: 15 of 23
16. (board p13 a2 c1)
   deleted: (at p13 c1)
   added: (in p13 a2)
   goals met: 15 of 23
17. (fly a2 c1 c2 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c2) (fuel-level a2 f0)
   goals met: 16 of 23
18. (debark p13 a2 c2)
   deleted: (in p13 a2)
   added: (at p13 c2)
   goals met: 17 of 23
19. (board p15 a3 c1)
   deleted: (at p15 c1)
   added: (in p15 a3)
   goals met: 17 of 23
20. (refuel a3 f0 f2)
   deleted: (fuel-level a3 f0)
   added: (fuel-level a3 f2)
   goals met: 17 of 23
21. (fly a3 c1 c2 f2 f1)
   deleted: (at a3 c1) (fuel-level a3 f2)
   added: (at a3 c2) (fuel-level a3 f1)
   goals met: 16 of 23
22. (debark p15 a3 c2)
   deleted: (in p15 a3)
   added: (at p15 c2)
   goals met: 17 of 23
23. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 18 of 23
24. (board p16 a1 c1)
   deleted: (at p16 c1)
   added: (in p16 a1)
   goals met: 18 of 23
25. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 18 of 23
26. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 17 of 23
27. (debark p16 a1 c2)
   deleted: (in p16 a1)
   added: (at p16 c2)
   goals met: 18 of 23
28. (board p17 a1 c2)
   deleted: (at p17 c2)
   added: (in p17 a1)
   goals met: 18 of 23
29. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 19 of 23
30. (debark p17 a1 c1)
   deleted: (in p17 a1)
   added: (at p17 c1)
   goals met: 20 of 23
31. (board p18 a2 c2)
   deleted: (at p18 c2)
   added: (in p18 a2)
   goals met: 20 of 23
32. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 20 of 23
33. (fly a2 c2 c1 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 19 of 23
34. (debark p18 a2 c1)
   deleted: (in p18 a2)
   added: (at p18 c1)
   goals met: 20 of 23
35. (board p19 a3 c2)
   deleted: (at p19 c2)
   added: (in p19 a3)
   goals met: 20 of 23
36. (fly a3 c2 c1 f1 f0)
   deleted: (at a3 c2) (fuel-level a3 f1)
   added: (at a3 c1) (fuel-level a3 f0)
   goals met: 21 of 23
37. (debark p19 a3 c1)
   deleted: (in p19 a3)
   added: (at p19 c1)
   goals met: 22 of 23
38. (fly a2 c1 c2 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c2) (fuel-level a2 f0)
   goals met: 23 of 23
